FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_lcd.c
/**
 ******************************************************************************
 * @file    stm32l1xx_lcd.c
 * @author  MCD Application Team
 * @version V1.1.1
 * @date    05-March-2012
 * @brief   This file provides firmware functions to manage the following
 *          functionalities of the LCD controller (LCD) peripheral:
 *           + Initialization and configuration
 *           + LCD RAM memory write
 *           + Interrupts and flags management
 *
 *  @verbatim
 *
 * ===============================================================================
 ##### LCD Clock #####
 #####===============================================================================
 #####[..] LCDCLK is the same as RTCCLK.
 #####[..] To configure the RTCCLK/LCDCLK, proceed as follows:
 #####   (+) Enable the Power Controller (PWR) APB1 interface clock using the
 #####       RCC_APB1PeriphClockCmd() function.
 #####   (+) Enable access to RTC domain using the PWR_RTCAccessCmd() function.
 #####   (+) Select the RTC clock source using the RCC_RTCCLKConfig() function.
 #####
 #####[..] The frequency generator allows you to achieve various LCD frame rates
 #####   starting from an LCD input clock frequency (LCDCLK) which can vary
 #####   from 32 kHz up to 1 MHz.
 #####
 ##### LCD and low power modes #####
 #####===============================================================================
 #####[..] The LCD still active during STOP mode.
 #####
 ##### How to use this driver #####
 #####===============================================================================
 #####[..]
 #####  (#) Enable LCD clock using
 #####      RCC_APB1PeriphClockCmd(RCC_APB1Periph_LCD, ENABLE) function.
 #####  (#) Configure the LCD prescaler, divider, duty, bias and voltage source
 #####      using LCD_Init() function.
 #####  (#) Optionally you can enable/configure:
 #####      (++) LCD High Drive using the LCD_HighDriveCmd() function.
 #####      (++) LCD COM/SEG Mux using the LCD_MuxSegmentCmd() function.
 #####      (++) LCD Pulse ON Duration using the LCD_PulseOnDurationConfig() function.
 #####      (++) LCD Dead Time using the LCD_DeadTimeConfig() function
 #####      (++) The LCD Blink mode and frequency using the LCD_BlinkConfig() function.
 #####      (++) The LCD Contrast using the LCD_ContrastConfig() function.
 #####  (#) Call the LCD_WaitForSynchro() function to wait for LCD_FCR register
 #####      synchronization.
 #####  (#) Call the LCD_Cmd() to enable the LCD controller.
 #####  (#) Wait until the LCD Controller status is enabled and the step-up
 #####      converter is ready using the LCD_GetFlagStatus() and
 #####      LCD_FLAG_ENS and LCD_FLAG_RDY flags.
 #####  (#) Write to the LCD RAM memory using the LCD_Write() function.
 #####  (#) Request an update display using the LCD_UpdateDisplayRequest()
 #####      function.
 #####  (#) Wait until the update display is finished by checking the UDD
 #####      flag status using the LCD_GetFlagStatus(LCD_FLAG_UDD).
 #####
 #####@endverbatim
 #####
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
 *
 * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
 * You may not use this file except in compliance with the License.
 * You may obtain a copy of the License at:
 *
 *        http://www.st.com/software_license_agreement_liberty_v2
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32l1xx_lcd.h"
#include "stm32l1xx_rcc.h"

/** @addtogroup STM32L1xx_StdPeriph_Driver
 * @{
 */

/** @defgroup LCD
 * @brief LCD driver modules
 * @{
 */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* ------------ LCD registers bit address in the alias region --------------- */
#define LCD_OFFSET    ( LCD_BASE - PERIPH_BASE )

/* --- CR Register ---*/

/* Alias word address of LCDEN bit */
#define CR_OFFSET            ( LCD_OFFSET + 0x00 )
#define LCDEN_BitNumber      0x00
#define CR_LCDEN_BB          ( PERIPH_BB_BASE + ( CR_OFFSET * 32 ) + ( LCDEN_BitNumber * 4 ) )

/* Alias word address of MUX_SEG bit */
#define MUX_SEG_BitNumber    0x07
#define CR_MUX_SEG_BB        ( PERIPH_BB_BASE + ( CR_OFFSET * 32 ) + ( MUX_SEG_BitNumber * 4 ) )


/* --- FCR Register ---*/

/* Alias word address of HD bit */
#define FCR_OFFSET      ( LCD_OFFSET + 0x04 )
#define HD_BitNumber    0x00
#define FCR_HD_BB       ( PERIPH_BB_BASE + ( FCR_OFFSET * 32 ) + ( HD_BitNumber * 4 ) )

/* --- SR Register ---*/

/* Alias word address of UDR bit */
#define SR_OFFSET        ( LCD_OFFSET + 0x08 )
#define UDR_BitNumber    0x02
#define SR_UDR_BB        ( PERIPH_BB_BASE + ( SR_OFFSET * 32 ) + ( UDR_BitNumber * 4 ) )

#define FCR_MASK         ( ( uint32_t ) 0xFC03FFFF )         /* LCD FCR Mask */
#define CR_MASK          ( ( uint32_t ) 0xFFFFFF81 )         /* LCD CR Mask */
#define PON_MASK         ( ( uint32_t ) 0xFFFFFF8F )         /* LCD PON Mask */
#define DEAD_MASK        ( ( uint32_t ) 0xFFFFFC7F )         /* LCD DEAD Mask */
#define BLINK_MASK       ( ( uint32_t ) 0xFFFC1FFF )         /* LCD BLINK Mask */
#define CONTRAST_MASK    ( ( uint32_t ) 0xFFFFE3FF )         /* LCD CONTRAST Mask */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup LCD_Private_Functions
 * @{
 */

/** @defgroup LCD_Group1 Initialization and Configuration functions
 *  @brief   Initialization and Configuration functions
 *
 * @verbatim
 * ===============================================================================
 ##### Initialization and Configuration functions #####
 #####===============================================================================
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Deinitializes the LCD peripheral registers to their default reset
 *         values.
 * @param  None
 * @retval None
 */
void LCD_DeInit( void )
{
    /* Enable LCD reset state */
    RCC_APB1PeriphResetCmd( RCC_APB1Periph_LCD, ENABLE );
    /* Release LCD from reset state */
    RCC_APB1PeriphResetCmd( RCC_APB1Periph_LCD, DISABLE );
}

/**
 * @brief  Initializes the LCD peripheral according to the specified parameters
 *         in the LCD_InitStruct.
 * @note   This function can be used only when the LCD is disabled.
 * @param  LCD_InitStruct: pointer to a LCD_InitTypeDef structure that contains
 *         the configuration information for the specified LCD peripheral.
 * @retval None
 */
void LCD_Init( LCD_InitTypeDef * LCD_InitStruct )
{
    /* Check function parameters */
    assert_param( IS_LCD_PRESCALER( LCD_InitStruct->LCD_Prescaler ) );
    assert_param( IS_LCD_DIVIDER( LCD_InitStruct->LCD_Divider ) );
    assert_param( IS_LCD_DUTY( LCD_InitStruct->LCD_Duty ) );
    assert_param( IS_LCD_BIAS( LCD_InitStruct->LCD_Bias ) );
    assert_param( IS_LCD_VOLTAGE_SOURCE( LCD_InitStruct->LCD_VoltageSource ) );

    LCD->FCR &= ( uint32_t ) FCR_MASK;
    LCD->FCR |= ( uint32_t ) ( LCD_InitStruct->LCD_Prescaler | LCD_InitStruct->LCD_Divider );

