FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_lcd.c
    LCD_WaitForSynchro();

    LCD->CR &= ( uint32_t ) CR_MASK;
    LCD->CR |= ( uint32_t ) ( LCD_InitStruct->LCD_Duty | LCD_InitStruct->LCD_Bias | \
                              LCD_InitStruct->LCD_VoltageSource );
}

/**
 * @brief  Fills each LCD_InitStruct member with its default value.
 * @param  LCD_InitStruct: pointer to a LCD_InitTypeDef structure which will
 *         be initialized.
 * @retval None
 */
void LCD_StructInit( LCD_InitTypeDef * LCD_InitStruct )
{
/*--------------- Reset LCD init structure parameters values -----------------*/
    LCD_InitStruct->LCD_Prescaler = LCD_Prescaler_1;                /*!< Initialize the LCD_Prescaler member */

    LCD_InitStruct->LCD_Divider = LCD_Divider_16;                   /*!< Initialize the LCD_Divider member */

    LCD_InitStruct->LCD_Duty = LCD_Duty_Static;                     /*!< Initialize the LCD_Duty member */

    LCD_InitStruct->LCD_Bias = LCD_Bias_1_4;                        /*!< Initialize the LCD_Bias member */

    LCD_InitStruct->LCD_VoltageSource = LCD_VoltageSource_Internal; /*!< Initialize the LCD_VoltageSource member */
}

/**
 * @brief  Enables or disables the LCD Controller.
 * @param  NewState: new state of the LCD peripheral.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void LCD_Cmd( FunctionalState NewState )
{
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    *( __IO uint32_t * ) CR_LCDEN_BB = ( uint32_t ) NewState;
}

/**
 * @brief  Waits until the LCD FCR register is synchronized in the LCDCLK domain.
 *   This function must be called after any write operation to LCD_FCR register.
 * @param  None
 * @retval None
 */
void LCD_WaitForSynchro( void )
{
    /* Loop until FCRSF flag is set */
    while( ( LCD->SR & LCD_FLAG_FCRSF ) == ( uint32_t ) RESET )
    {
    }
}

/**
 * @brief  Enables or disables the low resistance divider. Displays with high
 *         internal resistance may need a longer drive time to achieve
 *         satisfactory contrast. This function is useful in this case if some
 *         additional power consumption can be tolerated.
 * @note   When this mode is enabled, the PulseOn Duration (PON) have to be
 *         programmed to 1/CK_PS (LCD_PulseOnDuration_1).
 * @param  NewState: new state of the low resistance divider.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void LCD_HighDriveCmd( FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    *( __IO uint32_t * ) FCR_HD_BB = ( uint32_t ) NewState;
}

/**
 * @brief  Enables or disables the Mux Segment.
 * @note   This function can be used only when the LCD is disabled.
 * @param  NewState: new state of the Mux Segment.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void LCD_MuxSegmentCmd( FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    *( __IO uint32_t * ) CR_MUX_SEG_BB = ( uint32_t ) NewState;
}

/**
 * @brief  Configures the LCD pulses on duration.
 * @param  LCD_PulseOnDuration: specifies the LCD pulse on duration in terms of
 *         CK_PS (prescaled LCD clock period) pulses.
 *   This parameter can be one of the following values:
 *     @arg LCD_PulseOnDuration_0: 0 pulse
 *     @arg LCD_PulseOnDuration_1: Pulse ON duration = 1/CK_PS
 *     @arg LCD_PulseOnDuration_2: Pulse ON duration = 2/CK_PS
 *     @arg LCD_PulseOnDuration_3: Pulse ON duration = 3/CK_PS
 *     @arg LCD_PulseOnDuration_4: Pulse ON duration = 4/CK_PS
 *     @arg LCD_PulseOnDuration_5: Pulse ON duration = 5/CK_PS
 *     @arg LCD_PulseOnDuration_6: Pulse ON duration = 6/CK_PS
 *     @arg LCD_PulseOnDuration_7: Pulse ON duration = 7/CK_PS
 * @retval None
 */
void LCD_PulseOnDurationConfig( uint32_t LCD_PulseOnDuration )
{
    /* Check the parameters */
    assert_param( IS_LCD_PULSE_ON_DURATION( LCD_PulseOnDuration ) );

    LCD->FCR &= ( uint32_t ) PON_MASK;
    LCD->FCR |= ( uint32_t ) ( LCD_PulseOnDuration );
}

/**
 * @brief  Configures the LCD dead time.
 * @param  LCD_DeadTime: specifies the LCD dead time.
 *   This parameter can be one of the following values:
 *     @arg LCD_DeadTime_0: No dead Time
 *     @arg LCD_DeadTime_1: One Phase between different couple of Frame
 *     @arg LCD_DeadTime_2: Two Phase between different couple of Frame
 *     @arg LCD_DeadTime_3: Three Phase between different couple of Frame
 *     @arg LCD_DeadTime_4: Four Phase between different couple of Frame
 *     @arg LCD_DeadTime_5: Five Phase between different couple of Frame
 *     @arg LCD_DeadTime_6: Six Phase between different couple of Frame
 *     @arg LCD_DeadTime_7: Seven Phase between different couple of Frame
 * @retval None
 */
void LCD_DeadTimeConfig( uint32_t LCD_DeadTime )
{
    /* Check the parameters */
    assert_param( IS_LCD_DEAD_TIME( LCD_DeadTime ) );

    LCD->FCR &= ( uint32_t ) DEAD_MASK;
    LCD->FCR |= ( uint32_t ) ( LCD_DeadTime );
}

/**
 * @brief  Configures the LCD Blink mode and Blink frequency.
 * @param  LCD_BlinkMode: specifies the LCD blink mode.
 *   This parameter can be one of the following values:
 *     @arg LCD_BlinkMode_Off:           Blink disabled
 *     @arg LCD_BlinkMode_SEG0_COM0:     Blink enabled on SEG[0], COM[0] (1 pixel)
 *     @arg LCD_BlinkMode_SEG0_AllCOM:   Blink enabled on SEG[0], all COM (up to 8
 *                                       pixels according to the programmed duty)
 *     @arg LCD_BlinkMode_AllSEG_AllCOM: Blink enabled on all SEG and all COM
 *                                       (all pixels)
 * @param  LCD_BlinkFrequency: specifies the LCD blink frequency.
 *   This parameter can be one of the following values:
 *     @arg LCD_BlinkFrequency_Div8:    The Blink frequency = fLcd/8
 *     @arg LCD_BlinkFrequency_Div16:   The Blink frequency = fLcd/16
 *     @arg LCD_BlinkFrequency_Div32:   The Blink frequency = fLcd/32
 *     @arg LCD_BlinkFrequency_Div64:   The Blink frequency = fLcd/64
 *     @arg LCD_BlinkFrequency_Div128:  The Blink frequency = fLcd/128
 *     @arg LCD_BlinkFrequency_Div256:  The Blink frequency = fLcd/256
 *     @arg LCD_BlinkFrequency_Div512:  The Blink frequency = fLcd/512
 *     @arg LCD_BlinkFrequency_Div1024: The Blink frequency = fLcd/1024
 * @retval None
 */
void LCD_BlinkConfig( uint32_t LCD_BlinkMode,
                      uint32_t LCD_BlinkFrequency )
{
    /* Check the parameters */
    assert_param( IS_LCD_BLINK_MODE( LCD_BlinkMode ) );
    assert_param( IS_LCD_BLINK_FREQUENCY( LCD_BlinkFrequency ) );

    LCD->FCR &= ( uint32_t ) BLINK_MASK;
    LCD->FCR |= ( uint32_t ) ( LCD_BlinkMode | LCD_BlinkFrequency );
}

/**
 * @brief  Configures the LCD Contrast.
 * @param  LCD_Contrast: specifies the LCD Contrast.
 *   This parameter can be one of the following values:
 *     @arg LCD_Contrast_Level_0: Maximum Voltage = 2.60V
 *     @arg LCD_Contrast_Level_1: Maximum Voltage = 2.73V
 *     @arg LCD_Contrast_Level_2: Maximum Voltage = 2.86V
 *     @arg LCD_Contrast_Level_3: Maximum Voltage = 2.99V
 *     @arg LCD_Contrast_Level_4: Maximum Voltage = 3.12V
 *     @arg LCD_Contrast_Level_5: Maximum Voltage = 3.25V
 *     @arg LCD_Contrast_Level_6: Maximum Voltage = 3.38V
 *     @arg LCD_Contrast_Level_7: Maximum Voltage = 3.51V
 * @retval None
 */
void LCD_ContrastConfig( uint32_t LCD_Contrast )
{
    /* Check the parameters */
    assert_param( IS_LCD_CONTRAST( LCD_Contrast ) );

