FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_lcd.c
    LCD->FCR &= ( uint32_t ) CONTRAST_MASK;
    LCD->FCR |= ( uint32_t ) ( LCD_Contrast );
}

/**
 * @}
 */

/** @defgroup LCD_Group2  LCD RAM memory write functions
 *  @brief    LCD RAM memory write functions
 *
 * @verbatim
 * ===============================================================================
 ##### LCD RAM memory write functions #####
 #####===============================================================================
 #####[..] Using its double buffer memory the LCD controller ensures the coherency
 #####   of the displayed information without having to use interrupts to control
 #####   LCD_RAM modification.
 #####
 #####[..] The application software can access the first buffer level (LCD_RAM) through
 #####   the APB interface. Once it has modified the LCD_RAM, it sets the UDR flag
 #####   in the LCD_SR register using the LCD_UpdateDisplayRequest() function.
 #####
 #####[..] This UDR flag (update display request) requests the updated information
 #####   to be moved into the second buffer level (LCD_DISPLAY).
 #####
 #####[..] This operation is done synchronously with the frame (at the beginning of
 #####   the next frame), until the update is completed, the LCD_RAM is write
 #####   protected and the UDR flag stays high.
 #####
 #####[..] Once the update is completed another flag (UDD - Update Display Done) is
 #####   set and generates an interrupt if the UDDIE bit in the LCD_FCR register
 #####  is set.
 #####
 #####[..] The time it takes to update LCD_DISPLAY is, in the worst case, one odd
 #####   and one even frame.
 #####
 #####[..] The update will not occur (UDR = 1 and UDD = 0) until the display is
 #####   enabled (LCDEN = 1).
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Writes a word in the specific LCD RAM.
 * @param  LCD_RAMRegister: specifies the LCD Contrast.
 *   This parameter can be one of the following values:
 *     @arg LCD_RAMRegister_0: LCD RAM Register 0
 *     @arg LCD_RAMRegister_1: LCD RAM Register 1
 *     @arg LCD_RAMRegister_2: LCD RAM Register 2
 *     @arg LCD_RAMRegister_3: LCD RAM Register 3
 *     @arg LCD_RAMRegister_4: LCD RAM Register 4
 *     @arg LCD_RAMRegister_5: LCD RAM Register 5
 *     @arg LCD_RAMRegister_6: LCD RAM Register 6
 *     @arg LCD_RAMRegister_7: LCD RAM Register 7
 *     @arg LCD_RAMRegister_8: LCD RAM Register 8
 *     @arg LCD_RAMRegister_9: LCD RAM Register 9
 *     @arg LCD_RAMRegister_10: LCD RAM Register 10
 *     @arg LCD_RAMRegister_11: LCD RAM Register 11
 *     @arg LCD_RAMRegister_12: LCD RAM Register 12
 *     @arg LCD_RAMRegister_13: LCD RAM Register 13
 *     @arg LCD_RAMRegister_14: LCD RAM Register 14
 *     @arg LCD_RAMRegister_15: LCD RAM Register 15
 * @param  LCD_Data: specifies LCD Data Value to be written.
 * @retval None
 */
void LCD_Write( uint32_t LCD_RAMRegister,
                uint32_t LCD_Data )
{
    /* Check the parameters */
    assert_param( IS_LCD_RAM_REGISTER( LCD_RAMRegister ) );

    /* Copy data bytes to RAM register */
    LCD->RAM[ LCD_RAMRegister ] = ( uint32_t ) LCD_Data;
}

/**
 * @brief  Enables the Update Display Request.
 * @note   Each time software modifies the LCD_RAM it must set the UDR bit to
 *         transfer the updated data to the second level buffer.
 *         The UDR bit stays set until the end of the update and during this
 *         time the LCD_RAM is write protected.
 * @note   When the display is disabled, the update is performed for all
 *         LCD_DISPLAY locations.
 *         When the display is enabled, the update is performed only for locations
 *         for which commons are active (depending on DUTY). For example if
 *         DUTY = 1/2, only the LCD_DISPLAY of COM0 and COM1 will be updated.
 * @param  None
 * @retval None
 */
void LCD_UpdateDisplayRequest( void )
{
    *( __IO uint32_t * ) SR_UDR_BB = ( uint32_t ) 0x01;
}

/**
 * @}
 */

/** @defgroup LCD_Group3 Interrupts and flags management functions
 *  @brief   Interrupts and flags management functions
 *
 * @verbatim
 * ===============================================================================
 ##### Interrupts and flags management functions #####
 #####===============================================================================
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Enables or disables the specified LCD interrupts.
 * @param  LCD_IT: specifies the LCD interrupts sources to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg LCD_IT_SOF: Start of Frame Interrupt
 *     @arg LCD_IT_UDD: Update Display Done Interrupt
 * @param NewState: new state of the specified LCD interrupts.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void LCD_ITConfig( uint32_t LCD_IT,
                   FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_LCD_IT( LCD_IT ) );
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    if( NewState != DISABLE )
    {
        LCD->FCR |= LCD_IT;
    }
    else
    {
        LCD->FCR &= ( uint32_t ) ~LCD_IT;
    }
}

/**
 * @brief  Checks whether the specified LCD flag is set or not.
 * @param  LCD_FLAG: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg LCD_FLAG_ENS: LCD Enabled flag. It indicates the LCD controller status.
 *      @note  The ENS bit is set immediately when the LCDEN bit in the LCD_CR
 *             goes from 0 to 1. On deactivation it reflects the real status of
 *             LCD so it becomes 0 at the end of the last displayed frame.
 *     @arg LCD_FLAG_SOF: Start of Frame flag. This flag is set by hardware at
 *       the beginning of a new frame, at the same time as the display data is
 *       updated.
 *     @arg LCD_FLAG_UDR: Update Display Request flag.
 *     @arg LCD_FLAG_UDD: Update Display Done flag.
 *     @arg LCD_FLAG_RDY: Step_up converter Ready flag. It indicates the status
 *                        of the step-up converter.
 *     @arg LCD_FLAG_FCRSF: LCD Frame Control Register Synchronization Flag.
 *       This flag is set by hardware each time the LCD_FCR register is updated
 *       in the LCDCLK domain.
 * @retval The new state of LCD_FLAG (SET or RESET).
 */
FlagStatus LCD_GetFlagStatus( uint32_t LCD_FLAG )
{
    FlagStatus bitstatus = RESET;

    /* Check the parameters */
    assert_param( IS_LCD_GET_FLAG( LCD_FLAG ) );

    if( ( LCD->SR & LCD_FLAG ) != ( uint32_t ) RESET )
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

