FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_lcd.c
    return bitstatus;
}

/**
 * @brief  Clears the LCD's pending flags.
 * @param  LCD_FLAG: specifies the flag to clear.
 *   This parameter can be any combination of the following values:
 *     @arg LCD_FLAG_SOF: Start of Frame Interrupt
 *     @arg LCD_FLAG_UDD: Update Display Done Interrupt
 * @retval None
 */
void LCD_ClearFlag( uint32_t LCD_FLAG )
{
    /* Check the parameters */
    assert_param( IS_LCD_CLEAR_FLAG( LCD_FLAG ) );

    /* Clear the corresponding LCD flag */
    LCD->CLR = ( uint32_t ) LCD_FLAG;
}

/**
 * @brief  Checks whether the specified RTC interrupt has occurred or not.
 * @param  LCD_IT: specifies the LCD interrupts sources to check.
 *   This parameter can be one of the following values:
 *     @arg LCD_IT_SOF: Start of Frame Interrupt
 *     @arg LCD_IT_UDD: Update Display Done Interrupt.
 *     @note If the device is in STOP mode (PCLK not provided) UDD will not
 *          generate an interrupt even if UDDIE = 1.
 *          If the display is not enabled the UDD interrupt will never occur.
 * @retval The new state of the LCD_IT (SET or RESET).
 */
ITStatus LCD_GetITStatus( uint32_t LCD_IT )
{
    ITStatus bitstatus = RESET;

    /* Check the parameters */
    assert_param( IS_LCD_GET_IT( LCD_IT ) );

    if( ( LCD->SR & LCD_IT ) != ( uint16_t ) RESET )
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    if( ( ( LCD->FCR & LCD_IT ) != ( uint16_t ) RESET ) && ( bitstatus != ( uint32_t ) RESET ) )
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/**
 * @brief  Clears the LCD's interrupt pending bits.
 * @param  LCD_IT: specifies the interrupt pending bit to clear.
 *   This parameter can be any combination of the following values:
 *     @arg LCD_IT_SOF: Start of Frame Interrupt
 *     @arg LCD_IT_UDD: Update Display Done Interrupt
 * @retval None
 */
void LCD_ClearITPendingBit( uint32_t LCD_IT )
{
    /* Check the parameters */
    assert_param( IS_LCD_IT( LCD_IT ) );

    /* Clear the corresponding LCD pending bit */
    LCD->CLR = ( uint32_t ) LCD_IT;
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
